# GetWallBelCutPlClass

## Description
Gets the below cut plane class of the wall.

```pascal
FUNCTION GetWallBelCutPlClass(wall : HANDLE): LONGINT;
```

```python
def vs.GetWallBelCutPlClass(wall):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wall|HANDLE|The wall.|

## See Also
VS Functions:
SetWallBelCutPlClass

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Walls